In [1]:
import pandas as pd

In [2]:
data = pd.DataFrame({'Car_Manufacturer' : ['Toyota', 'Ford', 'Ford', 'Mercedes', 'Ford']})
data

  Car_Manufacturer
0           Toyota
1             Ford
2             Ford
3         Mercedes
4             Ford

In [3]:
one_hot_encodings = pd.get_dummies(data, columns=['Car_Manufacturer'])
one_hot_encodings

   Car_Manufacturer_Ford  Car_Manufacturer_Mercedes  Car_Manufacturer_Toyota
0                      0                          0                        1
1                      1                          0                        0
2                      1                          0                        0
3                      0                          1                        0
4                      1                          0                        0

In [4]:
data.join(one_hot_encodings)

,Car_Manufacturer,Car_Manufacturer_Ford,Car_Manufacturer_Mercedes,Car_Manufacturer_Toyota
0,Toyota,0,0,1
1,Ford,1,0,0
2,Ford,1,0,0
3,Mercedes,0,1,0
4,Ford,1,0,0